Autodesk.Revit.DB.BuiltInFailures.PointFailures.RegenFailure
Regeneration Failure.

Autodesk.Revit.DB.BuiltInFailures.PointFailures.HostParameterRangeError
Hosted Parameter must be between 0 and 1

Autodesk.Revit.DB.BuiltInFailures.PointFailures.HostMeasurementError
Invalid host curve measurement type or value or justification

Autodesk.Revit.DB.BuiltInFailures.PointFailures.EdgeHostedPointToBeUnhosted
A point element in a family was hosted on an edge outside its family and the edge no longer exists.  The point will remain placed but with no host.

Autodesk.Revit.DB.BuiltInFailures.PointFailures.CantChangeParamRotate
Can't rotate Element.

Autodesk.Revit.DB.BuiltInFailures.PointFailures.CantChangeParamMirror
Can't mirror Element.

Autodesk.Revit.DB.BuiltInFailures.PointFailures.CantChangeParamFlip
Can't flip Element.

Autodesk.Revit.DB.BuiltInFailures.PointFailures.CannotMakePointHostedByIntersection
Cannot make point hosted by intersection.

Autodesk.Revit.DB.BuiltInFailures.PointFailures
Failures about Point Element.